; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v10)
             (pred_11 ?v7 ?v1)
             (pred_8 ?v9 ?v1)
             (pred_2 ?v13 ?v9 )
	     (pred_9 ?v9)
             (pred_4 ?v11)
             (pred_3 ?v7)
             (pred_1 ?v1)
             (pred_7 ?v9)
             (pred_10 ?v7)
             (pred_12 ?v9)
             (pred_6 ))



(:action op_5
:parameters (?v4 ?v2 ?v12 ?v6)
:precondition (and (pred_4 ?v4) (pred_4 ?v2) (pred_3 ?v12) (pred_1 ?v6)
          (pred_5 ?v4 ?v2) (pred_11 ?v12 ?v6)
                   (pred_8 ?v2 ?v6) (pred_9 ?v4) 
                   (pred_7 ?v2) (pred_10 ?v12))
:effect (and  (pred_12 ?v2) (not (pred_7 ?v2))))


(:action op_4
:parameters (?v4 ?v5)
:precondition (and (pred_4 ?v4) (pred_4 ?v5)
               (pred_9 ?v4) (pred_5 ?v4 ?v5) (pred_12 ?v5))
:effect (and (pred_9 ?v5) (not (pred_9 ?v4))))

(:action op_1
:parameters (?v4 ?v12)
:precondition (and (pred_4 ?v4) (pred_3 ?v12) 
                  (pred_9 ?v4) (pred_2 ?v12 ?v4) (pred_6 ))
:effect (and (pred_10 ?v12)
   (not (pred_2 ?v12 ?v4)) (not (pred_6 ))))


(:action op_2
:parameters (?v4 ?v8 ?v3)
:precondition (and (pred_4 ?v4) (pred_3 ?v8) (pred_3 ?v3)
                  (pred_9 ?v4) (pred_10 ?v3) (pred_2 ?v8 ?v4))
:effect (and (pred_10 ?v8) (pred_2 ?v3 ?v4)
        (not (pred_10 ?v3)) (not (pred_2 ?v8 ?v4))))

(:action op_3
:parameters (?v4 ?v12)
:precondition (and (pred_4 ?v4) (pred_3 ?v12) 
                  (pred_9 ?v4) (pred_10 ?v12))
:effect (and (pred_6 ) (pred_2 ?v12 ?v4) (not (pred_10 ?v12)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_13 obj_28 obj_01 obj_20 obj_03 obj_10 obj_25 obj_32 obj_06 obj_22 obj_31 obj_02 obj_18 obj_11 obj_23 obj_04 obj_19 obj_16 obj_17 obj_30 obj_29 obj_08 obj_07 obj_27
    obj_12 obj_05 obj_26
    obj_14 obj_24 obj_09 obj_15
    )

    (:init
       (pred_6)

       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_28)
       (pred_4 obj_01)
       (pred_4 obj_20)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_25)
       (pred_4 obj_32)
       (pred_4 obj_06)
       (pred_4 obj_22)
       (pred_4 obj_31)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_11)
       (pred_4 obj_23)
       (pred_4 obj_04)
       (pred_4 obj_19)
       (pred_4 obj_16)
       (pred_4 obj_17)
       (pred_4 obj_30)
       (pred_4 obj_29)
       (pred_4 obj_08)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_1 obj_12)
       (pred_1 obj_05)
       (pred_1 obj_26)
       (pred_3 obj_14)
       (pred_3 obj_24)
       (pred_3 obj_09)
       (pred_3 obj_15)

       (pred_5 obj_21 obj_03)
       (pred_5 obj_21 obj_13)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_13 obj_28)
       (pred_5 obj_13 obj_21)
       (pred_5 obj_28 obj_25)
       (pred_5 obj_28 obj_01)
       (pred_5 obj_28 obj_13)
       (pred_5 obj_01 obj_32)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_01 obj_28)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_03 obj_21)
       (pred_5 obj_10 obj_31)
       (pred_5 obj_10 obj_25)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_25 obj_02)
       (pred_5 obj_25 obj_32)
       (pred_5 obj_25 obj_28)
       (pred_5 obj_25 obj_10)
       (pred_5 obj_32 obj_18)
       (pred_5 obj_32 obj_06)
       (pred_5 obj_32 obj_01)
       (pred_5 obj_32 obj_25)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_32)
       (pred_5 obj_22 obj_23)
       (pred_5 obj_22 obj_31)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_31 obj_04)
       (pred_5 obj_31 obj_02)
       (pred_5 obj_31 obj_10)
       (pred_5 obj_31 obj_22)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_02 obj_25)
       (pred_5 obj_02 obj_31)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_32)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_23 obj_30)
       (pred_5 obj_23 obj_04)
       (pred_5 obj_23 obj_22)
       (pred_5 obj_04 obj_29)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_04 obj_31)
       (pred_5 obj_04 obj_23)
       (pred_5 obj_19 obj_08)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_17 obj_27)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_30 obj_23)
       (pred_5 obj_29 obj_08)
       (pred_5 obj_29 obj_04)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_08 obj_19)
       (pred_5 obj_08 obj_29)
       (pred_5 obj_07 obj_27)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_27 obj_17)
       (pred_5 obj_27 obj_07)
       (pred_7 obj_19)
       (pred_7 obj_31)
       (pred_7 obj_02)
       (pred_7 obj_01)
       (pred_8  obj_19 obj_12)
       (pred_8  obj_31 obj_05)
       (pred_8  obj_02 obj_26)
       (pred_8  obj_01 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_25)
       (pred_12 obj_32)
       (pred_12 obj_06)
       (pred_12 obj_22)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_23)
       (pred_12 obj_04)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_30)
       (pred_12 obj_29)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_27)

       (pred_11  obj_14 obj_12)
       (pred_11  obj_24 obj_05)
       (pred_11  obj_09 obj_26)
       (pred_11  obj_15 obj_26)
       (pred_2 obj_14 obj_07)
       (pred_2 obj_24 obj_23)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_15 obj_25)
       (pred_9 obj_11)
    )

    (:goal (and
       (pred_2 obj_14 obj_06)
       (pred_2 obj_09 obj_28)
    ))
(:constraints
  (always (not (pred_9 obj_32)))
)
)

; plan
1. (op_1 obj_11 obj_09)
   deleted: (pred_2 obj_09 obj_11) (pred_6)
   added: (pred_10 obj_09)
   goals met: 0 of 2
2. (op_4 obj_11 obj_18)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_18)
   goals met: 0 of 2
3. (op_4 obj_18 obj_16)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_16)
   goals met: 0 of 2
4. (op_3 obj_16 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_6) (pred_2 obj_09 obj_16)
   goals met: 0 of 2
5. (op_4 obj_16 obj_07)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_07)
   goals met: 0 of 2
6. (op_1 obj_07 obj_14)
   deleted: (pred_2 obj_14 obj_07) (pred_6)
   added: (pred_10 obj_14)
   goals met: 0 of 2
7. (op_4 obj_07 obj_16)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_16)
   goals met: 0 of 2
8. (op_4 obj_16 obj_18)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_18)
   goals met: 0 of 2
9. (op_3 obj_18 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_6) (pred_2 obj_14 obj_18)
   goals met: 0 of 2
10. (op_4 obj_18 obj_16)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_16)
   goals met: 0 of 2
11. (op_1 obj_16 obj_09)
   deleted: (pred_2 obj_09 obj_16) (pred_6)
   added: (pred_10 obj_09)
   goals met: 0 of 2
12. (op_4 obj_16 obj_18)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_18)
   goals met: 0 of 2
13. (op_2 obj_18 obj_14 obj_09)
   deleted: (pred_10 obj_09) (pred_2 obj_14 obj_18)
   added: (pred_10 obj_14) (pred_2 obj_09 obj_18)
   goals met: 0 of 2
14. (op_4 obj_18 obj_11)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_11)
   goals met: 0 of 2
15. (op_4 obj_11 obj_06)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_06)
   goals met: 0 of 2
16. (op_3 obj_06 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_6) (pred_2 obj_14 obj_06)
   goals met: 1 of 2
17. (op_4 obj_06 obj_11)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_11)
   goals met: 1 of 2
18. (op_4 obj_11 obj_18)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_18)
   goals met: 1 of 2
19. (op_1 obj_18 obj_09)
   deleted: (pred_2 obj_09 obj_18) (pred_6)
   added: (pred_10 obj_09)
   goals met: 1 of 2
20. (op_5 obj_18 obj_02 obj_09 obj_26)
   deleted: (pred_7 obj_02)
   added: (pred_12 obj_02)
   goals met: 1 of 2
21. (op_4 obj_18 obj_02)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_02)
   goals met: 1 of 2
22. (op_4 obj_02 obj_25)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_25)
   goals met: 1 of 2
23. (op_4 obj_25 obj_28)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_28)
   goals met: 1 of 2
24. (op_3 obj_28 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_6) (pred_2 obj_09 obj_28)
   goals met: 2 of 2
